{
    "version": "https://jsonfeed.org/version/1",
    "title": "troi",
    "description": "",
    "home_page_url": "https://troi.se",
    "feed_url": "https://troi.se/feed.json",
    "user_comment": "",
    "icon": "https://troi.se/media/website/Gold_Troi_logo.png",
    "author": {
        "name": "Christoffer Råsten"
    },
    "items": [
        {
            "id": "https://troi.se/test-4.html",
            "url": "https://troi.se/test-4.html",
            "title": "About Me",
            "summary": "With a profound passion for digitalization, technology, and efficiency, my journey has been defined by a relentless pursuit of innovation that serves the&hellip;",
            "content_html": "\n  <p>\n    With a profound passion for digitalization, technology, and efficiency, my journey has been defined by a relentless pursuit of innovation that serves the interests of businesses, users, customers, and even my own daily routines. With over two decades entrenched in the realm of Information Technology, I have embraced diverse leadership roles that have shaped my expertise and perspective.<br><br>During my tenure spanning 20+ years, I’ve been at the helm of crucial endeavors, most recently as a consultant contributing my skills to prestigious entities like Telia and TV4. Prior to this, I held pivotal positions, including that of Head of Architecture and Chief Architect. Notably, my role in the digital transformation of Afa Insurance stands as a testament to my influence in architecting IT strategic frameworks and management systems that have paved the way for the organization’s digital odyssey.<br><br>Eager for new challenges, my appetite for growth remains insatiable — no task is too monumental or trivial. I invite you to explore my portfolio or connect with me directly.<br><br>Let’s embark on a shared journey toward innovation and excellence.\n  </p>\n\n    <h4 id=\"lessbrgreaterhow-can-i-help-you\">\n      <br>How can I help you?\n    </h4>\n\n  <p>\n    Contact me on +46 (0) 798 93 95 51 or Christoffer.Rasten@TROi.se\n  </p>\n<hr class=\"separator separator--dots\" />\n\n    <h5 id=\"my-resume\">\n      My resume\n    </h5>\n\n  <p>\n    <a href=\"https://troi.se/CV_Swe.pdf\" target=\"_blank\" download>Download Swedish CV (pdf)</a><br><a href=\"https://troi.se/CV_Eng.pdf\" target=\"_blank\" download>Download Enlish CV (pdf)</a><br><br>\n  </p>",
            "image": "https://troi.se/media/posts/5/openart-db378e155d50488aa89520eb64a89ca1_raw.jpg",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
            ],
            "date_published": "2024-06-26T11:12:51+02:00",
            "date_modified": "2024-08-06T09:12:59+02:00"
        },
        {
            "id": "https://troi.se/test-2.html",
            "url": "https://troi.se/test-2.html",
            "title": "Blog",
            "summary": "This blog is a platform for me to share my knowledge and experience of Enterprise and Software Engineering. I will only share information&hellip;",
            "content_html": "\n  <p>\n    This blog is a platform for me to share my knowledge and experience of Enterprise and Software Engineering. I will only share information that I have personally experienced, observed and/or analyzed, and any opinions I express here are my own and not necessarily those of my employer or customers.<br><br>The information contained on this blog is intended to provide general information and should not be used as the basis for making business, legal or other decisions. While I will make every effort to ensure the accuracy and reliability of the information provided, I make no promises or guarantees. Any reliance you place on this information is therefore done so at your own risk. I will not be held responsible for any inaccuracies or omissions.\n  </p>\n<hr class=\"separator separator--dots\" />",
            "image": "https://troi.se/media/posts/2/agenda-968603_1280-2.jpg",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
            ],
            "date_published": "2024-06-25T15:54:50+02:00",
            "date_modified": "2024-08-06T09:20:40+02:00"
        },
        {
            "id": "https://troi.se/test.html",
            "url": "https://troi.se/test.html",
            "title": "Previous Assignments ",
            "content_html": "\n  <p>\n    \n  </p>",
            "image": "https://troi.se/media/posts/1/computer-4795762_1280.jpg",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
            ],
            "date_published": "2024-06-25T15:24:36+02:00",
            "date_modified": "2024-08-06T09:20:51+02:00"
        },
        {
            "id": "https://troi.se/friends-and-stuff.html",
            "url": "https://troi.se/friends-and-stuff.html",
            "title": "Friends &amp; Stuff",
            "summary": "Friends: David Pettersson Lars Barkman Verksamhetsarkitektur Thoughtworks Thoughtworks - Technology radar Zalando Open Source OpenAI Range: Why Generalists Triumph in a Specialized World&hellip;",
            "content_html": "<h2 id=\"friends\">Friends:</h2>\n<p><a href=\"https://www.pettersson.dev\">David Pettersson</a> <Br/>\n<a href=\"https://www.larsbarkman.com\">Lars Barkman</a> <Br/>\n<Br/></p><h2 id=\"links\">Links:</h2>\n<p><a href=\"https://www.verksamhetsarkitektur.se\">Verksamhetsarkitektur</a> <Br/>\n<a href=\"https://www.thoughtworks.com\">Thoughtworks</a> <Br/>\n<a href=\"https://www.thoughtworks.com/radar\">Thoughtworks - Technology radar</a> <Br/>\n<a href=\"https://opensource.zalando.com/\">Zalando Open Source</a> <Br/>\n<a href=\"https://openai.com/\">OpenAI</a> <Br/></p><h2 id=\"books\">Books:</h2>\n<p><a href=\"https://en.wikipedia.org/wiki/Range:_Why_Generalists_Triumph_in_a_Specialized_World\">Range: Why Generalists Triumph in a Specialized World</a> <Br/>\n<a href=\"https://danlebrero.com/2020/01/22/accelerate-high-performing-technology-orgs-summary/\">Accelerate: Building and Scaling High Performing Technology Organizations</a> <Br/>\n<a href=\"https://fundamentalsofsoftwarearchitecture.com/\">Fundamentals of software architecture, an engineering approach</a>  <Br/>\n<a href=\"https://teamtopologies.com/\">Team Topologies</a> <Br/>\n<a href=\"https://www.goodreads.com/book/show/42611483-escaping-the-build-trap\">Escaping the builtrap</a></p><h2 id=\"clips\">Clips:</h2>\n<h2 id=\"just-for-fun\">Just for fun:</h2>\n<p>A thought-provoking clip about how traditional management can lead to inefficiencies in larger organizations (Swedish)\n<a href=\"https://youtu.be/B6Lx104sPis\">Mellanchefsparadoxen</a></p>",
            "image": "https://troi.se/media/posts/7/people-4823356_1280.jpg",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
            ],
            "date_published": "2023-09-26T12:29:00+02:00",
            "date_modified": "2024-08-06T10:14:22+02:00"
        },
        {
            "id": "https://troi.se/the-power-of-models-and-business-capabilities.html",
            "url": "https://troi.se/the-power-of-models-and-business-capabilities.html",
            "title": "The Power of Models and Business Capabilities",
            "summary": "In the world of architecture, a significant part of our work revolves around achieving alignment and consensus. To reach this common ground and&hellip;",
            "content_html": "\n  <p>\n    In the world of architecture, a significant part of our work revolves around achieving alignment and consensus. To reach this common ground and facilitate discussions, we rely heavily on various types of models.Creating a model or map is akin to crafting a tool to understand and simplify a complex reality. To truly comprehend something, we need to see the connections within it. To make these connections clear, we must simplify, highlight certain aspects, and downplay others. One particular tool that has gained prominence, or at least frequent mention, is the capability map, which directs our attention to what our company or organization does. <br><br>It's an easy topic of discussion with different parts of the business because it doesn't contain solutions and technology but elevates the discussion to another level. I have been involved in developing these maps and even transformed them into a card game used in planning meetings, sparking conversations within an operationally-oriented organization about tactical moves and goals. These discussions are essential if we are to genuinely confront the ongoing transformation in society, often referred to as digitalization.<br><br>**The Art of Creating Understanding**<br><br>As architects, our primary goal is to design structures and systems that function seamlessly and efficiently. However, achieving this isn't always straightforward, especially when you're dealing with multifaceted challenges that require collaboration and consensus among diverse stakeholders.<br><br>This is where the power of models and maps comes into play. Think of them as a cartographer's tools, helping us navigate the complex landscapes of business and technology. Just as a map simplifies a sprawling terrain into manageable proportions, models distill intricate realities into comprehensible concepts.<br><br>**The Essence of Models**<br><br>When we create a model or map, we're essentially crafting a lens through which we can view and dissect a complex reality. These models serve multiple purposes:<br><br>Simplification: Complex problems often involve numerous interrelated components. Models allow us to simplify these complexities, highlighting the most critical elements while temporarily setting aside others.<br><br>Highlighting Relationships: Models enable us to identify and visualize connections and dependencies within a system. This helps stakeholders grasp the bigger picture and how different parts of an organization fit together.<br><br>Facilitating Discussions: Models provide a common language for discussions. They transcend technical jargon and allow people from different backgrounds and departments to engage in meaningful conversations.<br><br>Alignment and Consensus: Achieving alignment and consensus is often the primary goal. Models create a shared understanding, reducing misunderstandings and conflicts.<br><br>**Understanding Business Capabilities**<br><br>Before we dive into the \"angel\" of business capabilities, let's clarify what we mean by it. A business capability defines “what” a business does at its core. This differs from “how” things are done or where they are done. Business capabilities are the core of the business architecture<br><br>![Layers of change](/assets/images/Layers.png)<br><br>**The Rise of Capability Maps**<br><br>One model that has gained prominence in recent years is the capability map. It's a tool that shifts the focus from \"how\" an organization operates to \"what\" it does. This shift is crucial, especially in the age of digital transformation, where adaptability and innovation are paramount.<br><br>Capability maps don't delve into specific solutions or technologies but rather serve as a high-level guide. They outline the core functions and activities of an organization, providing a foundation for strategic discussions. By elevating the conversation to this level, organizations can better prepare themselves to navigate the ongoing digital revolution.<br><br>![Business Capability Map, Example](/assets/images/Capabilities.png)<br><br>Source: [SlideShare](http://www.slideshare.net/leobarella/business-value-measurements-and-the-solution-design-framework)<br><br>**Turning Maps into Games: A Creative Approach**<br><br>I've had the privilege of participating in the creation of capability maps and even transforming them into interactive tools. One such iteration was turning a capability map into a card game that we used during planning meetings. This innovative approach transformed a highly operational and solution-oriented organization into one that discussed tactical maneuvers and long-term goals.<br><br>The card game acted as a bridge between the abstract world of capability mapping and the practical needs of the organization. It prompted discussions about strategic moves and future visions. Such discussions are crucial if we are to effectively address the ongoing transformation in society, often referred to as digitalization.<br><br><br>In the journey of digital transformation, it's easy to get lost in the technicalities of systems and processes. However, by keeping the angle of business capabilities at the forefront, you not only stay grounded in your company's essence but also remain open to the limitless possibilities that the digital age offers.<br><br>So, the next time you embark on a digital transformation initiative, remember to embrace the angle of business capabilities. Start with the \"what\" before delving into the \"how.\" In doing so, you'll find that your journey becomes more purposeful, adaptable, and ultimately, successful.<br><br>Why not sketch out your map and indicate your intended direction?\n  </p>",
            "image": "https://troi.se/media/posts/15/compass-5137269_1280.jpg",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
            ],
            "date_published": "2023-09-09T09:33:00+02:00",
            "date_modified": "2024-08-06T09:33:28+02:00"
        },
        {
            "id": "https://troi.se/embracing-the-power-of-digital-transformation.html",
            "url": "https://troi.se/embracing-the-power-of-digital-transformation.html",
            "title": "Embracing the Power of Digital Transformation",
            "summary": "If you feel that your digital transformation efforts are moving at a snail's pace or not receiving the attention they deserve, you're not&hellip;",
            "content_html": "\n  <p>\n    If you feel that your digital transformation efforts are moving at a snail's pace or not receiving the attention they deserve, you're not alone. Many organizations face this challenge. So let´s explore strategies to overcome this hurdle, such as creating a compelling vision, securing leadership support, prioritizing initiatives for maximum impact, and addressing the following:<br><br>Digital transformation, with its continually evolving technology landscape, can often seem like a complex path to navigate. In the following discussion, we will adress the fundamental elements that define this transformative journey: the integration of technology, process optimization, customer-centricity, and innovation. Furthermore, we will provide guidance to help you align your objectives harmoniously with the digital transformation agenda. Together, we will embark on a journey of understanding, exploration, and empowerment, enabling you to identify areas for improvement and unlock the full potential of the digital era.<br><br>Moving Beyond an IT-Centric Focus:<br><br>In the era of digitalization, it's imperative for organizations to move beyond an IT-centric focus. While technology forms the backbone of digital transformation, it's just one piece of the puzzle. <mark>Instead of fixating solely on IT solutions, organizations should adopt a holistic approach that considers people, processes, and technology in unison.</mark><br><br>By shifting focus towards a broader perspective, organizations can align their digitalization efforts with their mission, vision, and overall goals. This approach ensures that technology doesn't exist in isolation but serves as an enabler for the entire organization. It promotes a seamless integration of technology into every facet of the business, from enhancing customer experiences to streamlining internal operations.<br><br>Ultimately, moving beyond an IT-centric focus in digitalization means recognizing that technology is a means to an end – the end being the fulfillment of an organization's overarching vision. It's about leveraging technology as a tool to drive innovation, efficiency, and growth while keeping the bigger picture in mind. In this way, organizations can fully harness the transformative power of digitalization to thrive in the digital age.<br><br>Challenges:<br>*  Organizational Silos: Organizational silos refer to the situation in which different departments, teams, or units within an organization operate in isolation from one another, often leading to communication and collaboration barriers.<br>*  Cost Allocation: Allocating resources for technology may overshadow other critical aspects of your mission.<br>*  Resistance to Change: Focusing solely on IT can lead to resistance when integrating it with other parts of your organization.<br>*  Reduced Communication: Poor communication between departments. When teams do not share information or collaborate, it can result in duplication of efforts, misalignment of goals, and missed opportunities.<br>*  Alignment Issues: Ensuring that technology aligns with your holistic approach can be challenging.<br><br>Where to Start:<br><br>*  Cross-Functional Teams: Create cross-functional teams to work on specific projects or initiatives. This encourages collaboration and allows employees from different areas to work together.See post [Gardening Teamwork](https://troi.se/posts/teamwork/)<br>*  Leadership Support: Leaders should set the example by collaborating across departments and promoting a culture of cooperation. <br>*  Shared Goals: Ensure that departments have shared goals and objectives that align with the overall mission and vision of the organization.<br>*  Develop a holistic strategy: Create high-level plans (strategies) that consider people, processes, and technology to fulfill your mission and vision.<br>*  Set specific goals for holistic transformation: These goals should encompass all aspects of your organization, not just IT.<br>*  Choose integrated tactics: These are detailed methods for achieving your holistic objectives, addressing people and processes as well as technology.<br>*  Implement holistic changes: Execute your plans and tactics to ensure that digital transformation benefits your entire organization.<br>*  Measure key results: Assess the progress and success of your holistic approach to digital transformation to ensure alignment with your mission and vision.<br>*  Performance Metrics: Evaluate and reward employees based on their ability to work collaboratively and achieve shared goals.<br><br>*Cultivating a Growth and Innovation Mindset:*<br><br>Cultivating a growth and innovation-focused mindset is essential for successful digital transformation. It's akin to planting seeds of creativity to nurture growth toward your mission and vision. Your mission, vision, strategies, goals, and tactics guide how you cultivate these ideas.<br><br>Challenges:<br><br>*  Assumptions: We are stuck in old truths and solutions<br>*  Risk Aversion: Overcoming the fear of trying new things is essential for innovation to thrive.<br>*  Resource Allocation: Allocating resources, including time and talent, to innovative projects is crucial.<br><br><br>Where to Start:<br><br>*  Apply \"First Principles Thinking”, This approach enables individuals to question assumptions, break free from traditional norms, and craft innovative solutions. See upcoming post [First Principle](https://troi.se/posts/first_principle/).<br>*  Start by aligning innovation with your mission and vision: Ensure that your innovation efforts directly contribute to fulfilling your overarching purpose and inspiring future.<br>*  Set specific innovation-related goals: These goals should align with your strategies and contribute to fulfilling your mission.<br>*  Choose effective innovation tactics: These are the detailed methods for achieving your innovation-related objectives, all in support of your goals. See Post [How Guardrail Empower Teams](https://troi.se/posts/guiding-principles-and-vision/)<br>*  Measure key results: Assess the progress and success of your innovation efforts to ensure they align with your mission and vision.<br><br>*Customer-Centricity:*<br><br>Being customer-centric is about creating a positive customer experience that aligns with your organization's mission and vision. Your strategies and goals guide how you achieve this.<br><br>Challenges:<br><br>*  Understanding Customer Needs: Knowing what your customers want is crucial for achieving your strategic objectives. <br>*  Data Privacy: Protecting customer data is essential while striving to meet their expectations.<br>*  Competing with Customer Expectations: Staying in sync with evolving customer expectations is key to fulfilling your mission.<br><br>Where to Start:<br><br>*  Stop guessing: Ask and involve the customers.<br>*  Begin by aligning customer-centricity with your mission and vision: Ensure that your customer-centric initiatives directly contribute to fulfilling your overarching purpose and inspiring future.<br>*  Craft a customer-centric strategy: Develop high-level plans (strategies) outlining how your customer-centric approach will support your mission and vision.<br>*  Set specific customer-related goals: These goals should align with your strategies and contribute to fulfilling your mission.<br>*  Choose effective customer-centric tactics: These are the detailed methods for achieving your customer-focused objectives, all in support of your goals.<br>*  Implement customer-centric initiatives: Execute your plans and tactics to create a positive customer experience.<br>*  Measure key results: Assess the progress and success of your customer-centric efforts.<br><br>*Process Optimization:*<br><br>Process optimization is like fine-tuning the engine of your organization to efficiently drive towards your mission and vision. Your mission, vision, strategies, goals, and tactics guide this optimization journey.<br><br>Challenges:<br><br>*  Identifying Inefficiencies: Recognizing where processes can be improved is critical to achieving your strategic goals.<br>* Employee Buy-In: Getting everyone on board with process changes is essential for successful implementation.<br>*  Measuring Progress: Tracking key results helps ensure that process optimizations align with your mission.<br><br>Where to Start:<br><br>*  Begin by aligning process improvements with your mission and vision: Ensure that optimizing your processes directly contributes to fulfilling your overarching purpose and inspiring future.<br>*  Craft a process optimization strategy: Dont be afraid of starting over. [Zooming in and out](https://troi.se/posts/zooming/).<br>*  Set specific process-related goals: These goals should align with your strategies and contribute to fulfilling your mission.<br>*  Select effective process tactics: These are the detailed methods for achieving your process-related objectives, all in support of your goals.<br>*  Implement process improvements: Execute your plans and tactics to fine-tune your organization's processes.<br>*  Measure key results: Assess the progress and success of your process optimization efforts to ensure they align with your mission and vision.<br><br>*In Conclusion: Prioritizing the Elephant's Pieces, Taking Action, and Embracing Learning*<br><br>As we conclude our exploration of digital transformation and aligning objectives, it's worth remembering the old saying: \"How do you eat an elephant? One bite at a time.\" In the vast landscape of digital transformation, it's easy to feel overwhelmed by the enormity of the task at hand. However, the key lies in the art of prioritization. Just as each bite is vital when consuming an elephant, each step is critical in<br>your journey.<br><br>Prioritization serves as the compass that guides your progress. It's not merely about understanding; it's about taking action. It's better to begin than to merely talk. By breaking down your objectives into manageable pieces, addressing the core components one at a time, and carefully prioritizing your efforts, you not only make the monumental task achievable but also ensure that your transformation aligns seamlessly with your mission and vision.<br><br>In this journey, remember the power of learning. Embrace each step with curiosity and empathy, for it's through learning that we evolve with the ever-shifting expectations of the digital age. And amidst the challenges and complexities, never forget to have fun on the way. Celebrate every achievement, no matter how small, and savor the progress you make.<br><br>With a blend of purpose, persistence, and a passion for learning, you're not only equipped to thrive but to enjoy every moment of your transformative journey. So, take that first step, embark on your transformation journey, and remember that prioritization, learning, evolving, and celebrating are all part of the exciting adventure that lies ahead. Your future success awaits, and it's a journey worth celebrating every step of the way.\n  </p>",
            "image": "https://troi.se/media/posts/16/snail-4729777_1280.jpg",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
            ],
            "date_published": "2023-09-03T09:36:00+02:00",
            "date_modified": "2024-08-06T09:45:57+02:00"
        },
        {
            "id": "https://troi.se/a-personal-story-of-digital-awakening.html",
            "url": "https://troi.se/a-personal-story-of-digital-awakening.html",
            "title": "A Personal Story of Digital Awakening",
            "summary": "In the year 2016, I found myself standing at the threshold of a new era—the era of digital transformation. It all began with&hellip;",
            "content_html": "\n  <p>\n    In the year 2016, I found myself standing at the threshold of a new era—the era of digital transformation. It all began with a seemingly innocuous question posed by our CEO during a company meeting: \"Is our IT future-proof?\" Little did I know that this question would mark the beginning of a profound journey that would reshape my perspective on the role of architecture and technology in business.<br><br>Driven by curiosity and a desire to understand the implications of our CEO's inquiry, I sought guidance from experts in the field of tech and digitalization. Through a stroke of fortune, I had the privilege of connecting with influential thought leaders such as Adrian Cockcroft from Netflix and AWS, and Rodrigue Schaefer, the Head of Engineering at Zalando.<br><br>These tech visionaries shared a common sentiment—an unwavering belief in the transformative power of integrating IT as a natural part of the business. They emphasized that IT should not be treated as a separate entity but as a key differentiator, deeply ingrained in the fabric of every organization. Their words resonated deeply with me, and I couldn't help but wonder why this realization was not emanating from leadership in more organizations.<br><br>As I delved deeper into the subject, I discovered that many companies were merely scratching the surface of digital transformation. They would rebrand their traditional approaches, incorporating a few modern technologies and methodologies, but failing to grasp the true potential of digitalization. It became increasingly clear that without comprehensive comprehension and wholehearted embrace at the leadership level, the conversion to a digital-first mindset would either fail to materialize or progress at a sluggish pace.<br><br>The knowledge I gained from these influential figures and my personal experiences still hold true to this day. They emphasized the difficulties that organizations encounter when they ignore or underestimate the impact of digital transformation. In a society where technology propels progress and molds customer demands, businesses that hesitate to adopt digitalization wholeheartedly run the risk of falling behind.<br><br>Fast forward to the present day, and the importance of digital transformation has only intensified. Countless success stories abound in industries such as insurance, banking, retailing, and media, where organizations have harnessed the power of digitalization to achieve remarkable results.<br><br>Through my personal journey of digital awakening, I have come to appreciate the immense value of embracing digital transformation wholeheartedly. It is not just about adopting new technologies; it is about fundamentally shifting the mindset and culture of an organization to leverage the full potential of digital possibilities.<br><br>As we stand at the precipice of a digital revolution, it is imperative that organizations understand the profound impact digital transformation can have on their future success. Leaders must embrace the potential of technology and champion its integration within their organizations. They must foster a culture of innovation, empower their employees to embrace change, and ensure that digitalization is not merely a superficial rebranding of traditional approaches.<br><br>My personal journey of digital awakening has reinforced the significance of top management buy-in, interest, and understanding in achieving successful digital transformation. Without the occurrence of this transformation, progress will be hindered or significantly delayed. It is a journey that continues to evolve, as organizations across the globe navigate the challenges and opportunities presented by the digital age. <br><br>As time progresses, it becomes evident that technology, systems, information, business capabilities, organization, and leadership should of-course reinforce one another rather than work against each other. So, which models align with each other, and which ones do not? So Architectural thinking and design span across everything.<br><br>So, let us embark on this transformative journey together, fueled by the knowledge that the future belongs to those who wholeheartedly embrace the power of digital transformation.<br><br>If you have the time why not take a look at Adrians talk from GOTO 2016, Stockholm <br>- It´s Simple<br><br><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/a8Re9Cvv6nU\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\"></iframe></div>![image](https://user-images.githubusercontent.com/19704400/225951579-b8b3548b-341d-441c-b022-4167cf052107.png)<br>\n  </p>",
            "image": "https://troi.se/media/posts/17/sunrise-1905602_1280.jpg",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
            ],
            "date_published": "2023-07-06T09:48:00+02:00",
            "date_modified": "2024-08-06T10:00:07+02:00"
        },
        {
            "id": "https://troi.se/how-to-tackle-digital-transformation.html",
            "url": "https://troi.se/how-to-tackle-digital-transformation.html",
            "title": "How to tackle digital transformation",
            "summary": "Welcome back! Today, we're diving into the fascinating topic of digital transformation. Whether you're experiencing slow progress, lack of attention, or struggling to&hellip;",
            "content_html": "\n  <p>\n    Welcome back! Today, we're diving into the fascinating topic of digital transformation. Whether you're experiencing slow progress, lack of attention, or struggling to understand its implications, I'll provide my perspective on each of these aspects to pique your interest and encourage further exploration.<br><br>But first, let's clarify what digital transformation entails and why it matters.<br><br>Digital transformation is a term often thrown around in discussions about business and technology. However, its meaning can be elusive, leading to confusion and miscommunication. In a world where communication is crucial, it's essential to have a common understanding of terms and concepts.<br><br>The impact of miscommunication can be felt in every industry. With the emergence of digital technologies, terms like digitization, digitalization, digital transformation, and digital business transformation have become intertwined. They are often used interchangeably, creating misunderstandings and differing expectations.<br><br>When assumptions are made about shared understanding, disagreements and conflicts arise. For instance, if two colleagues discuss a project but interpret its goals differently, their expectations for the outcome will diverge. This lack of clarity can impede progress and cause frustration.<br><br>To avoid these scenarios, it's vital to take the time to define what we mean when discussing digital transformation. Establishing a common understanding ensures alignment and collaboration. It paves the way for faster implementation of digital transformation initiatives.<br><br>Now, let's explore the different aspects of digital transformation.<br><br>### Digitization<br><br> Digitization is the process of converting analog data into a digital format. This includes tasks such as scanning physical documents or creating digital copies of photographs. Digitization enables the storage and manipulation of data in a digital format.<br><br>### Digitalization<br><br>Digitalization, on the other hand, focuses on using digital technologies to transform business operations. It involves implementing digital tools and processes to optimize existing workflows and increase efficiency. Digitalization is aimed at leveraging technology to drive business growth and improve performance.<br><br>### Digital Transformation<br><br>Digital transformation encompasses both digitization and digitalization, but it goes beyond them. It involves using digital technologies to fundamentally change how a business operates. This may include rethinking business models and processes, leveraging new technologies, and creating new value propositions for customers.<br><br>### Digital Business Transformation<br><br>Lastly, digital business transformation refers to using digital technologies to transform an entire business. It encompasses everything from digitizing processes to implementing new digital business models that disrupt traditional industries.<br><br>In summary, miscommunication can significantly impact digital transformation projects, resulting in delays, misunderstandings, and disagreements. Clarifying terminology and aligning expectations are key to overcome these challenges. By doing so, we can avoid confusion, foster collaboration, and accelerate the implementation of digital transformation initiatives.<br><br>Now that we have a clear understanding of these terms, let's delve into the different aspects that might spark your interest:<br><br>### Understanding and Support from Top Leadership<br><br>Digital transformation requires buy-in and support from top leadership. If you're struggling to gain their understanding or commitment, I'll discuss effective approaches to communicate the benefits of digital transformation, showcase successful case studies, and address concerns or resistance that leaders may have.<br><br><br>### Progressing Slowly or Lack of Attention<br><br>If you feel that your digital transformation efforts are moving at a snail's pace or not receiving the attention they deserve, you're not alone. Many organizations face this challenge. In my blog, I'll explore strategies to overcome this hurdle, such as creating a compelling vision, securing leadership support, and prioritizing initiatives for maximum impact.<br><br>### Comprehending Digital Transformation and Aligning Objectives<br><br>Understanding what digital transformation entails can be daunting. I'll break down the key components, including the integration of technology, process optimization, customer-centricity, and innovation. Additionally, I'll offer insights on aligning your objectives with digital transformation and identifying areas for improvement.<br><br>### Cultivating a Growth and Innovation Mindset<br><br>Shifting to a growth and innovation-focused mindset is vital for successful digital transformation. I'll explore strategies for fostering this mindset within your organization, including encouraging experimentation, embracing failure as a learning opportunity, and promoting a culture of continuous learning and improvement.<br><br>### Moving Beyond an IT-Centric Focus<br><br>While technology plays a crucial role in digital transformation, it's important to remember that it's not the end goal. I'll discuss how to shift from an IT-centric focus to a holistic approach that considers people, processes, and technology. This broader perspective ensures that digital transformation initiatives address the entire organization's needs and goals.<br><br>### Letting Go of Old Ways<br><br>Change can be challenging, especially when it involves letting go of old ways of doing things. I'll provide strategies for overcoming resistance to change, fostering a culture of adaptability, and empowering employees to embrace new technologies and processes.<br><br>### Structuring, Fostering Trust, and Cultivating Agile Culture<br><br>Creating an environment that supports digital transformation requires the right structure, trust among teams, and an agile culture. I'll explore frameworks for structuring digital transformation initiatives, building trust among employees and stakeholders, and nurturing an agile mindset that enables rapid adaptation and innovation.<br><br>### Curiosity and Continuous Learning<br><br>If you're simply curious about digital transformation, I'll provide a comprehensive overview of its benefits, challenges, and best practices. Additionally, I'll share resources and further reading materials to satisfy your thirst for knowledge.<br><br>In conclusion, the journey of digital transformation can be complex, but it is a topic that offers immense possibilities for growth, innovation, and staying competitive in today's digital age. By addressing the why's and providing insights on various aspects of digital transformation, my blog post aims to spark your interest, clarify misconceptions, and guide you on your digital transformation journey.<br><br>I invite you to join the discussion in the comment section below if you have additional questions or want to explore specific issues related to digital transformation. Let's embark on this exciting journey together!<br><br>See you soon :)<br><div class=\"commentbox\"></div>\n  </p>",
            "image": "https://troi.se/media/posts/18/istockphoto-1417761158-612x612-2.jpg",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
            ],
            "date_published": "2023-04-19T09:50:00+02:00",
            "date_modified": "2024-08-06T09:52:02+02:00"
        },
        {
            "id": "https://troi.se/breaking-free-from-monolithic-thinking.html",
            "url": "https://troi.se/breaking-free-from-monolithic-thinking.html",
            "title": "Breaking free from monolithic thinking",
            "summary": "In recent years, companies have increasingly adopted an agile approach to working and innovation, as this method has been proven to be an&hellip;",
            "content_html": "\n  <p>\n    In recent years, companies have increasingly adopted an agile approach to working and innovation, as this method has been proven to be an effective way to develop products and services quickly and effectively. However, the success of an agile approach can be hindered by a monolithic thinking and centralization.<br><br>Monolithic thinking is the idea that all aspects of a company should be managed in the same manner. This centralization of control stifles creativity and innovation, as it limits the ability of individual team members to experiment and come up with new ideas. It also slows down decision-making, as each decision must be approved by the top-level management or centralized team.<br><br>Centralization of control also hinders agility and responsiveness. With a centralized structure, teams are unable to react quickly to changes in the market or customer demands. This can lead to missed opportunities and a slower rate of product or service delivery.<br><br>Finally, monolithic thinking and centralization can also lead to increased bureaucracy and costs. Teams are often forced to adhere to rigid processes that are not tailored to the individual needs of the organization, which can lead to wastage of time and resources.<br><br>To ensure that an agile approach is successful, companies must strive for more flexible and distributed decision-making and architecture. This means that teams should be empowered to make decisions independently, so that they can react quickly to changes in the market or customer demands. Additionally, companies should strive for greater transparency and open communication between teams, so that they can collaborate effectively and speed up decision-making.<br><br>By moving away from monolithic thinking and centralization, companies can ensure that their agile approach to working and innovation is successful. This will help them to develop products and services quickly and effectively, and ensure that they remain competitive in the ever-changing business landscape.<br><br>Hidden Monoliths and Coupling: How to Identify and Mitigate Complexity in the Workplace<br><br>In today's ever-changing world of technology, understanding the concept of monoliths and coupling is vital for businesses to remain competitive. Monoliths are large, interconnected systems that are difficult to change without breaking its entire structure. Coupling is when two or more components of a system are linked, making it difficult to modify one without changing the other. Monoliths are often hidden from view, but they play a powerful role in both the digital and physical worlds. They can be found in software applications, databases, solutions, and even in the way we think about our workplaces. Monolithic structures are characterized by strong coupling, which can increase the resilience and efficiency of a system, but can also limit its ability to adapt to changing conditions. In this blog, we will explore the different types of monoliths and coupling, how they can be identified and mitigated in the workplace.<br><br>Application Monoliths: An application monolith is a single, large application that contains all the code and data needed to operate the system. It is difficult to make changes to this type of monolith without affecting its entire structure, making it hard to modify or maintain.<br><br>Joined-at-the-Database Monoliths: A joined-at-the-database monolith is a single database that contains data from multiple applications. This type of monolith is difficult to change or modify without affecting the entire system.<br><br>Monolithic Builds: A monolithic build is when all components of the system are built at the same time. This type of monolith is difficult to modify or maintain without affecting the entire system.<br><br>Monolithic Coupled Releases: A monolithic coupled release is when two or more components of the system must be released at the same time and in the right order. This type of monolith can be difficult to modify or maintain without affecting the entire system.<br><br>Another aspect of monolithic thinking is the single view of the world, standardization and one size fits all is a solutions. When it comes to problem solving, using the same tool or approach for every problem is not always the best option. Rather, the best approach is to assess the problem and determine which tool or approach will be the most effective. There are multiple tools and approaches that can be used to solve a particular problem and it's important to understand which one is the most suitable.<br><br>Monolithic Model (Single View of the World): A monolithic model is when all components of the system are viewed as a single entity. This type of monolith is difficult to modify or maintain without affecting the entire system.<br><br>Monolithic Thinking (Standardization): Monolithic thinking is when all components of the system are standardized and seen as a single entity. This type of monolith can be difficult to modify or maintain without affecting the entire system.<br><br>Monolithic Workplace: A monolithic workplace is when the entire organization is seen as a single entity. This type of monolith can be difficult to modify or maintain without affecting the entire system.<br><br>Understanding the different types of monoliths and coupling can help businesses identify and mitigate complexity in the workplace. By breaking down large, interconnected systems into smaller, more manageable components, businesses can make changes or modifications more easily and quickly. This can help businesses remain competitive and reduce their costs in the long run.<br><br>One way of doing this is the domain driven approach. Domain Driven Development and bounded context are two of the most powerful tools in software development. Both concepts help to create efficient and effective software solutions by making sure that the solution is organized around meaningful business domains.<br><br>Domain driven design (DDD) is an approach to software development that focuses on the underlying structure of a software system and the domain it operates in. It emphasizes the importance of exploring and understanding the domain before attempting to develop a software solution. By understanding the underlying business requirements and mapping them to software elements, the development process becomes much more focused and efficient.<br><br>Bounded context is an important concept in DDD. It is the process of separating out different areas or aspects of the system and defining the boundaries between them. By doing this, the system can be divided into smaller, more manageable parts, which can be better understood and more easily maintained.<br><br>For example, consider a banking application. The application can be divided into separate bounded contexts such as customer information, accounts, payments and loan processing. Each of these bounded contexts could be further divided into smaller bounded contexts, such as customer accounts, customer payments, loan products and loan processing. By dividing the system into smaller pieces, developers can focus on what is important for each area and create more focused solutions.<br><br>Domain driven design and bounded context are extremely useful for software development. By understanding the domain and dividing the system into more manageable pieces, architects and developers can create more efficient and effective software solutions. Additionally, by reducing complexity and increasing focus, the development process becomes much faster and more efficient.<br><br>You can advantageously apply Bounded Context with a Best of breed strategy. This focuses on leveraging the best-of-breed components within a given bounded context to create the most optimized solution. By using the best-of-breed components within a given bounded context, businesses are able to create a system that is tailored to the specific needs of their users while also reducing costs and complexity. Additionally, this strategy allows businesses to quickly deploy new features and capabilities as the needs of their users evolve. Ultimately, Best of Breed with Bounded Context Focus is an effective and efficient way to create highly optimized solutions.<br><br>Monolithic structures can be beneficial, but they can also limit the ability of a system to adapt to changing conditions and hinder agile ways of working. As with any type of structure, it is important to assess the benefits and drawbacks of monolithic thinking and centralization in order to determine the best approach for your particular needs and goals.<br><br>&gt; <em>A book tip for this subject is Matthew Skelton and Manuel Pais book: Team Topologies - Organizing business and technology teams for fast flow</em>\n  </p>",
            "image": "https://troi.se/media/posts/14/Blog-Banner-560x315-px.jpeg",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
            ],
            "date_published": "2023-01-26T09:28:00+01:00",
            "date_modified": "2024-08-06T10:37:43+02:00"
        },
        {
            "id": "https://troi.se/attracting-talent.html",
            "url": "https://troi.se/attracting-talent.html",
            "title": "Attracting talent",
            "summary": "As the world continues to become increasingly digitalized, more businesses are realizing the importance of becoming software companies. Software development is no longer&hellip;",
            "content_html": "\n  <p>\n    As the world continues to become increasingly digitalized, more businesses are realizing the importance of becoming software companies. Software development is no longer just a service that businesses can outsource; it’s an essential part of business development and growth. By embracing software-driven operations, businesses can stay ahead of their competition, attract talented employees, and better their chances of success in the long run.<br><br>Software is a powerful tool that can help a business increase efficiency and improve customer satisfaction while reducing costs. It can also give a business a competitive edge, as software can help automate processes, making them faster and more accurate. Furthermore, software can provide insights and data that can be used to make better decisions. The possibilities are almost endless.<br><br>In order to capitalize on the potential of software, businesses must invest in software-driven strategies. This means investing in the right software and hiring the right people to develop and maintain it. Additionally, businesses should strive to provide a supportive environment for software development so that their staff can be creative, productive, and successful.<br><br>With the right software and personnel, businesses can use software to gain a competitive edge. As the competition gets tougher, businesses must do more to remain competitive. Software development is an essential part of this strategy. By talking about how they’re becoming software companies on their digitalization journeys, businesses can attract the right talent and be well-positioned to play the “infinity game.”<br><br>Software developers need to be integrated into the planning and decision-making process and be given the freedom to come up with innovative solutions and ideas. This requires an investment in the right technology, but also in the right people.<br><br>It is important for businesses to talk openly about their digitalization journey and the challenges they may have faced. This allows them to showcase their successes and learn from their mistakes. For example, businesses should be vocal about their software development process, the technologies they use, the challenges they faced, and the lessons they have learned. This will help to attract talented developers and also demonstrate that the business is serious about its digitalization efforts.<br><br>Businesses should strive to play the ‘infinity game’ – that is, never stop learning and developing. In the modern digital landscape, the only way to stay ahead of the competition is to constantly innovate and improve. By talking openly about their digitalization journey, businesses can demonstrate that they are committed to playing the infinity game.<br><br>In summary, businesses should be more vocal about their digitalization journey – from transitioning from a traditional business to a software-driven one, to the technologies they use and the challenges they face. This will help attract talent people and show that businesses are serious about their digitalization efforts. Finally, businesses should strive to play the infinity game, continuously learning and developing in order to stay ahead of the competition. The future is a mix of Bussiness, People and Technology.\n  </p>",
            "image": "https://troi.se/media/posts/19/pexels-photo-11737041.jpeg",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
            ],
            "date_published": "2022-12-28T10:03:00+01:00",
            "date_modified": "2024-08-06T10:04:33+02:00"
        }
    ]
}
