{
    "version": "https://jsonfeed.org/version/1",
    "title": "troi",
    "description": "",
    "home_page_url": "https://troi.se",
    "feed_url": "https://troi.se/feed.json",
    "user_comment": "",
    "icon": "https://troi.se/media/website/Gold_Troi_logo.png",
    "author": {
        "name": "Christoffer Råsten"
    },
    "items": [
        {
            "id": "https://troi.se/founder-troi-arkitektur-ab.html",
            "url": "https://troi.se/founder-troi-arkitektur-ab.html",
            "title": "Founder TROi Arkitektur AB",
            "summary": "In the besinning of 2021 I decided to start my own business to see new businesses, people, solutions and challenges to grow in&hellip;",
            "content_html": "\n  <p>\n    In the besinning of 2021 I decided to start my own business to see new businesses, people, solutions and challenges to grow in my trade.<br>\n  </p>",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
                   "Assignment"
            ],
            "date_published": "2024-08-06T15:23:22+02:00",
            "date_modified": "2024-08-06T15:42:42+02:00"
        },
        {
            "id": "https://troi.se/domain-architect.html",
            "url": "https://troi.se/domain-architect.html",
            "title": "Domain Architect",
            "summary": "As domain Architect I covered and where responsible for these domains, - Insurance - BI - Web - Finance Target Architecture",
            "content_html": "\n  <p>\n    As domain Architect I covered and where responsible for these domains,<br>- Insurance<br>- BI<br>- Web<br>- Finance\n  </p>\n\n  <p>\n    Target Architecture\n  </p>",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
                   "Assignment"
            ],
            "date_published": "2024-08-06T15:22:27+02:00",
            "date_modified": "2024-08-06T15:42:54+02:00"
        },
        {
            "id": "https://troi.se/solutions-architect.html",
            "url": "https://troi.se/solutions-architect.html",
            "title": "Solutions Architect",
            "summary": "As a solution architect I focused on insurance and customer communications. Here is some examples of the work. ## Customer communication Provided and&hellip;",
            "content_html": "\n  <p>\n    As a solution architect I focused on insurance and customer communications.<br><br>Here is some examples of the work.<br><br>## Customer communication<br><br>Provided and implemented solutions for notifications to digital mailboxes to letters in the customer preferred channel.<br><br>Another solution covered automation of incoming insurance claims and additions to insurance matters.<br><br>But the biggest achievement in this role was to prove the value of the customer self-service web solution that handled insurance claims, <br>customer vase status and correspondence. It also supported case supplements and automations in the claims process.<br>\n  </p>",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
                   "Assignment"
            ],
            "date_published": "2024-08-06T15:21:18+02:00",
            "date_modified": "2024-08-06T15:43:01+02:00"
        },
        {
            "id": "https://troi.se/developer.html",
            "url": "https://troi.se/developer.html",
            "title": "Developer",
            "summary": "System developer, working with insurance claims, customer communications and automations.",
            "content_html": "\n  <p>\n    System developer, working with insurance claims, customer communications and automations.<br>\n  </p>",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
                   "Assignment"
            ],
            "date_published": "2024-08-06T15:20:26+02:00",
            "date_modified": "2024-08-06T15:43:11+02:00"
        },
        {
            "id": "https://troi.se/okr-objectives-and-key-results.html",
            "url": "https://troi.se/okr-objectives-and-key-results.html",
            "title": "OKR - Objectives and Key Results",
            "summary": "Do you want to improve the performance of your teams and business? OKR (Objectives and Key Results) is an effective way to set&hellip;",
            "content_html": "\n  <p>\n    Do you want to improve the performance of your teams and business? OKR (Objectives and Key Results) is an effective way to set goals and track progress. It is a powerful management system designed to help organizations and individuals focus on what matters most, measure what gets done and make the most out of their resources.<br><br>OKRs are a powerful goal-setting methodology that can help you stretch your outcomes and reach for more ambitious goals. The beauty of OKRs is that they allow you to set ambitious goals while still giving you the flexibility to adjust them based on what’s achievable.<br><br>OKRs combine objectives and key results to help you stay focused on the most important tasks and measure your progress along the way. Objectives provide clarity and direction, while key results track progress, and help determine if you’re on the right track. With OKRs, you can stretch yourself and your team to achieve more than you thought possible.<br><br>An OKR is basically a goal broken down into clear objectives and measurable key results. Each OKR consists of an objective, 3-5 key results, and success metrics. Objectives are the overall goals you want to achieve, while key results are the measurable outcomes that you can use to track progress.<br><br>OKR helps align teams and departments around the same objectives and key results. It encourages collaboration and accountability, as everyone can see each other’s progress. This helps to ensure that everyone is working towards the same goals and that everyone has a shared understanding of what needs to be achieved.<br><br>OKR also helps you to prioritize tasks and focus on the most important work. By setting measurable key results, you can easily identify areas for improvement and focus on activities that will have the most impact.<br><br>Overall, OKR is a great tool to help you set goals, track progress and improve performance. It encourages collaboration, keeps everyone focused on the same objectives, and helps prioritize tasks. If you’re looking for a way to improve your team’s performance, then OKR is a great option.<br><br>Here are just a few reasons why you should use OKRs for your business: <br><br>1. OKRs are highly measurable. When setting OKRs, it’s important to create goals that are measurable and can easily be tracked. This makes it easy to track successes and identify areas for improvement.<br><br>2. OKRs provide visibility and transparency. Everyone in the organization can see where their work is going, and how their efforts are contributing to the bigger picture. This increases engagement and accountability.<br><br>3. OKRs allow for better alignment. OKRs help ensure that everyone in the organization is working toward the same objectives. This helps to create a unified vision and a shared goal.<br><br>4. OKRs promote better communication. When everyone in the organization is working towards the same goal, communication is improved. This makes it easier to collaborate and work together to accomplish the desired objectives.<br><br>If you’re looking for a way to stay organized, increase productivity, and measure performance, OKRs are the way to go. Try implementing OKRs in your organization today and see the difference it can make!\n  </p>",
            "image": "https://troi.se/media/posts/32/pexels-photo-3077882.webp",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
                   "Blog_Post"
            ],
            "date_published": "2024-08-06T15:19:42+02:00",
            "date_modified": "2024-08-06T15:43:20+02:00"
        },
        {
            "id": "https://troi.se/staying-ahead-of-the-curve.html",
            "url": "https://troi.se/staying-ahead-of-the-curve.html",
            "title": "Staying ahead of the curve",
            "summary": "ThoughtWorks Technology Radar is a great tool for keeping up to date on the latest trends in technology and the industry. This is&hellip;",
            "content_html": "\n  <p>\n    ThoughtWorks Technology Radar is a great tool for keeping up to date on the latest trends in technology and the industry. This is an invaluable resource for any organization, especially those looking to stay ahead of the curve in terms of new and emerging technologies. The radar provides a comprehensive overview of the latest technologies, trends, and strategies that are currently seen as important or innovative in the industry.<br><br>The Technology Radar is split into four different categories: Adopt, Trial, Assess, and Hold. It provides an easy way to evaluate the current state of a technology, as well as how it is likely to evolve in the future. This helps organizations make better decisions about the technologies they should invest in, and those they should avoid.<br><br>The Adopt section of the radar includes technologies that are mature enough to be used in a production environment. This includes technologies that are stable, well tested, and have a wide range of applications. Technologies in this section are considered to be worth investing in and are recommended for organizations looking to make use of them.<br><br>The Trial section includes technologies that are still quite new, but are well worth exploring. This could include emerging technologies that may be risky, but have potential for great rewards. The Assess section includes technologies that may have potential, but have not yet been proven in a production environment.<br><br>Finally, the Hold section includes technologies that are not yet ready for adoption, or are not considered to be important. This could include technologies that are still in the early stages of development, or those that are not seen as important to the organization.<br><br>In conclusion, ThoughtWorks Technology Radar is a great tool for staying up to date on the latest technologies and trends. It provides a comprehensive overview of the current state of technology and helps organizations make better decisions when it comes to investing in new technologies.<br><br>Every six months or so, Thoughtworks publishes its [Technology Radar](https://www.thoughtworks.com/radar).<br><br>If you think this is a good idea, you can [create one](https://www.thoughtworks.com/radar/byor) for your organization.<br><br>Here is an example how Zalando has done it [Zalando tech radar](https://opensource.zalando.com/tech-radar/).\n  </p>",
            "image": "https://troi.se/media/posts/31/pexels-photo-129742.jpeg",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
                   "Blog_Post"
            ],
            "date_published": "2024-08-06T15:18:05+02:00",
            "date_modified": "2024-08-06T15:43:33+02:00"
        },
        {
            "id": "https://troi.se/chief-architect-and-head-of-architecture.html",
            "url": "https://troi.se/chief-architect-and-head-of-architecture.html",
            "title": "Chief Architect and Head of Architecture",
            "summary": "As Chief Architect, I had the pleasure of building and working with a very focused and driven architecture team with the size of&hellip;",
            "content_html": "\n  <p>\n    As Chief Architect, I had the pleasure of building and working with a very focused and driven architecture team with the size of \"Two Large Pizzas\" who did a amazing job together with our key bussiness stakeholders, in-house partners and development teams.<br><br>I was also a member of the IT management team and reported to CIO.<br><br>Here are some examples of the work we did while acting as change agents for the organizations digital transformation.<br><br>## Digital transformation<br>We worked hard to clarify the IT operational model and aligne it for the need of <br>more efficient deliveries of customer value and establish IT as a value-creating <br>partner in the business and not just as a supplier.<br><br>This resulted in the beginning of productization of the organization's capabilities <br>together with modern agile principles, working methods and technology where IT is <br>seen as a natural part of the company's business development.<br><br><br>## IT-strategy<br><br>As part of the digitization, we also was responsible for developing an IT strategy that <br>clearly described and guided the organization towards the targeted state.<br><br>The IT strategy we produced was based on an IT strategic framework that highlights six strategic areas <br>with the aim of strengthening customer focus, collaboration and innovation. <br><br>The Strategic areas where:<br><br>- Ensuring continuous competence development<br>- Designing solutions for effective and continuous improvement<br>- Embracing the innovative power of the outside world<br>- Ensuring trusting relationships<br>- Activating the digital eco system<br>- Exploring the power of intelligent technology.<br><br>This resulted in an architecture evolution and modernization of the self developed claims systems, skills transfer and new infrastructure with a focus on customer value, automation, loosely coupled services, DevOps and everything as code.<br><br><br>## Enterprise architecture<br><br>Another mission was to define and establish the capabilities around enterprise architecture:<br><br>- Business architecture<br>- Information architecture<br>- Solution architecture<br>- Infrastructure architecture<br>- Security architecture.<br><br>This resulted in an enterprise architecture function with light-weight <br>documentation of architectural decisions, guiding principles and a curious coaching <br>approach, which together with various business areas and delivery teams develops the <br>organization's offering in \"business services\" based on the business capabillities.<br><br>## Collaboration and communication<br><br>As a natural part of all transformations, it required collaboration <br>and clear communication and anchoring with both management and employees <br>regarding changed responsibilities, competencies, delivery models. <br><br>It also changed and developed the business processes and business offers both within the <br>organization and externally.<br><br>One of the biggest changes was the creation of \"Business Products\", cross functional teams that included both business and developement competences to be able to act quick within a specified domain based on the business capabillity map with a clear RACI model. The teams where staffed by self selection with no management interferance. The process in short, the product owner first pitch their product and then every individual by them self selected the product they wanted to work with. We did this in close cooperation with product management and was a big step in the digialization journey. <br><br>The archiecture team had daily close contact with the teams and in most cases also a team member to drive the solution against the target architecture using the guiding principles.<br><br>## Audits<br><br>The architecture team also supported internal and external auditors to guide them in solutions and documentation.<br><br><br>## Data protection and GDPR<br><br>The architecture team also supported the data protection function and business domains around process development, implementation and implementation of processes linked to data protection.<br><br>And ofcourse we did al lot more :)\n  </p>",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
                   "Assignment"
            ],
            "date_published": "2024-08-06T15:07:03+02:00",
            "date_modified": "2024-08-06T15:44:18+02:00"
        },
        {
            "id": "https://troi.se/it-architect-team-commercial.html",
            "url": "https://troi.se/it-architect-team-commercial.html",
            "title": "IT Architect, Team Commercial",
            "summary": "Member of the commercial team at Telia CPS Product and Transformation, PA Pay TV. Team commercial handles and continously evolve solutions around purchase&hellip;",
            "content_html": "\n  <p>\n    Member of the commercial team  at Telia CPS Product and Transformation, PA Pay TV.<br><br>Team commercial handles and continously evolve solutions around purchase flows, In-app-messages, products, subscription management, PSP, payments, marketing and CRM for C More and Telia play.\n  </p>",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
                   "Assignment"
            ],
            "date_published": "2024-08-06T14:49:27+02:00",
            "date_modified": "2024-08-06T15:45:04+02:00"
        },
        {
            "id": "https://troi.se/integration-strategy-and-enterprise-architecture.html",
            "url": "https://troi.se/integration-strategy-and-enterprise-architecture.html",
            "title": "Integration strategy and Enterprise architecture",
            "summary": "Architect in the initiative concerning integration modernization and system documentation for Business Apps Sweden (B2B advertising). - Establish Integration strategy - Domain dokumentation&hellip;",
            "content_html": "\n  <p>\n    Architect in the initiative concerning integration modernization and system documentation for Business Apps Sweden (B2B advertising).<br><br>- Establish Integration strategy<br>- Domain dokumentation<br>- Member of the Integration team\n  </p>",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
                   "Assignment"
            ],
            "date_published": "2024-08-06T14:47:16+02:00",
            "date_modified": "2024-08-06T15:45:17+02:00"
        },
        {
            "id": "https://troi.se/payment-as-a-service.html",
            "url": "https://troi.se/payment-as-a-service.html",
            "title": "Payment as a service",
            "summary": "My first assignment as a solution architect consultant was to change payment solution and checkout flows for a transaction-intensive product. The solution covered&hellip;",
            "content_html": "\n  <p>\n    My first assignment as a solution architect consultant was to change payment solution and checkout flows for a transaction-intensive product. <br>The solution covered integrations with CRM and internal business processes. <br><br>The assignment included collaboration with external partners, target- and solution architecture as well as implementation and migration.&nbsp;\n  </p>\n\n  <p>\n    \n  </p>",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
                   "Assignment"
            ],
            "date_published": "2024-08-06T14:46:28+02:00",
            "date_modified": "2024-08-06T15:45:35+02:00"
        }
    ]
}
