{
    "version": "https://jsonfeed.org/version/1",
    "title": "troi",
    "description": "",
    "home_page_url": "https://troi.se",
    "feed_url": "https://troi.se/feed.json",
    "user_comment": "",
    "icon": "https://troi.se/media/website/Gold_Troi_logo.png",
    "author": {
        "name": "Christoffer Råsten"
    },
    "items": [
        {
            "id": "https://troi.se/innovation-through-foundation-building-on-the-best-to-create-the-future.html",
            "url": "https://troi.se/innovation-through-foundation-building-on-the-best-to-create-the-future.html",
            "title": " Innovation Through Foundation: Building on the Best to Create the Future",
            "summary": "The Art of Innovation: Building on What’s Already Great In the fast-paced world of technology, the word \"innovation\" is often thrown around as&hellip;",
            "content_html": "\n  <p>\n    <strong>The Art of Innovation: Building on What’s Already Great<br></strong>In the fast-paced world of technology, the word \"innovation\" is often thrown around as if it's synonymous with creating something entirely new and groundbreaking. But here's a thought that may seem counterintuitive: sometimes, the most innovative thing you can do is not to invent something from scratch.<br><br><strong>The Power of Trends and Standards<br></strong>In today's digital landscape, being innovative doesn’t always mean being original. In many cases, it’s about being strategic. Trends evolve for a reason; they reflect the collective wisdom of a community or industry. By keeping an eye on these trends, we can discern which practices are becoming de facto standards and which emerging methods are poised to become the next big thing.<br><br>For instance, consider how many companies are adopting specific API design guidelines, such as Zalando's RESTful guidelines. These aren’t just rules—they’re the result of many iterations, discussions, and refinements by experts in the field. By embracing such well-established standards, we save ourselves the time and effort of reinventing the wheel, allowing us to focus our energy on refining and innovating within that framework.<br><br><strong>The Role of Communities in Shaping Innovation<br></strong>The beauty of our connected world is the wealth of knowledge and experience that is freely available through various communities. By engaging with these communities—whether they’re open-source contributors, industry forums, or professional networks—we gain insights that can shape our approach to innovation.<br><br>Communities are where ideas are tested, debated, and refined. They provide a sounding board for new concepts and offer feedback that can be invaluable in improving upon existing solutions. By staying actively involved in these conversations, we position ourselves not just as followers of trends, but as active participants in their evolution.<br><br><strong>Building on What’s Already Great<br></strong>It’s easy to get caught up in the race to be the first to market with a new concept. But there is immense value in taking what already exists and making it better. After all, innovation doesn’t just mean doing something new—it also means doing something better.<br><br>Zalando’s RESTful guidelines are a perfect example of this principle in action. By building on established best practices, Zalando created a set of guidelines that many other organizations now look to as a benchmark for quality. This kind of innovation—refining and enhancing what already works—is often more impactful than starting from scratch.<br><br><strong>Sharing and Collaboration: The Keys to Collective Success<br></strong>The final piece of the puzzle is sharing what you’ve learned. By sharing your insights, your processes, and your innovations, you allow others to build on your work, just as you’ve built on the work of those before you. This kind of openness not only fosters a spirit of collaboration but also accelerates the pace of innovation across the board.<br><br>When we allow others to comment on and refine our ideas, we benefit from their perspectives and expertise. This collaborative approach leads to stronger, more resilient solutions that stand the test of time. In the end, it’s a win-win situation—everyone benefits when knowledge is shared and innovation is a collective effort.<br><br><strong>Conclusion: Creativity Rooted in Fundamentals<br></strong>In conclusion, the fundamentals provided by guidelines and standards don't limit our creativity; they enable it. By grounding ourselves in these principles, we free up mental space to think more creatively and solve problems from first principles. This combination of solid groundwork and imaginative thinking allows us to build truly magical solutions.<br><br>When we understand and respect the frameworks that have been established, we give ourselves the tools to innovate in meaningful ways. The real magic happens when we merge this foundational knowledge with bold, creative thinking, leading to solutions that are both innovative and grounded in reality. Let's embrace this synergy, knowing that true innovation arises when creativity is informed by a strong foundation.\n  </p>\n<hr class=\"separator separator--dots\" />\n\n  <p>\n    <a href=\"https://opensource.zalando.com/restful-api-guidelines/\" target=\"_blank\">https://opensource.zalando.com/restful-api-guidelines/</a>\n  </p>\n\n  <p>\n    <a href=\"https://www.thoughtworks.com/radar\" target=\"_blank\">https://www.thoughtworks.com/radar</a>\n  </p>\n\n  <p>\n    \n  </p>",
            "image": "https://troi.se/media/posts/37/stones-2704411_640.webp",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
                   "Integrations",
                   "Blog_Post",
                   "Architecture"
            ],
            "date_published": "2024-08-07T11:23:20+02:00",
            "date_modified": "2024-08-07T11:24:47+02:00"
        },
        {
            "id": "https://troi.se/founder-troi-arkitektur-ab.html",
            "url": "https://troi.se/founder-troi-arkitektur-ab.html",
            "title": "Founder TROi Arkitektur AB",
            "summary": "In the besinning of 2021 I decided to start my own business to see new businesses, people, solutions and challenges to grow in&hellip;",
            "content_html": "\n  <p>\n    In the besinning of 2021 I decided to start my own business to see new businesses, people, solutions and challenges to grow in my trade.\n  </p>\n\n  <p>\n    \n  </p>",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
                   "Assignment"
            ],
            "date_published": "2024-08-06T15:23:22+02:00",
            "date_modified": "2024-08-07T09:04:40+02:00"
        },
        {
            "id": "https://troi.se/domain-architect.html",
            "url": "https://troi.se/domain-architect.html",
            "title": "Domain Architect",
            "summary": "As domain Architect I covered and where responsible for these domains, - Insurance - BI - Web - Finance Target Architecture",
            "content_html": "\n  <p>\n    As domain Architect I covered and where responsible for these domains,<br>- Insurance<br>- BI<br>- Web<br>- Finance\n  </p>\n\n  <p>\n    Target Architecture\n  </p>",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
                   "Assignment"
            ],
            "date_published": "2024-08-06T15:22:27+02:00",
            "date_modified": "2024-08-06T15:42:54+02:00"
        },
        {
            "id": "https://troi.se/solutions-architect.html",
            "url": "https://troi.se/solutions-architect.html",
            "title": "Solutions Architect",
            "summary": "As a solution architect I focused on insurance and customer communications. Here is some examples of the work. ## Customer communication Provided and&hellip;",
            "content_html": "\n  <p>\n    As a solution architect I focused on insurance and customer communications.<br><br>Here is some examples of the work.<br><br>## Customer communication<br><br>Provided and implemented solutions for notifications to digital mailboxes to letters in the customer preferred channel.<br><br>Another solution covered automation of incoming insurance claims and additions to insurance matters.<br><br>But the biggest achievement in this role was to prove the value of the customer self-service web solution that handled insurance claims, <br>customer vase status and correspondence. It also supported case supplements and automations in the claims process.<br>\n  </p>",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
                   "Assignment"
            ],
            "date_published": "2024-08-06T15:21:18+02:00",
            "date_modified": "2024-08-06T15:43:01+02:00"
        },
        {
            "id": "https://troi.se/developer.html",
            "url": "https://troi.se/developer.html",
            "title": "Developer",
            "summary": "System developer, working with insurance claims, customer communications and automations.",
            "content_html": "\n  <p>\n    System developer, working with insurance claims, customer communications and automations.<br>\n  </p>",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
                   "Assignment"
            ],
            "date_published": "2024-08-06T15:20:26+02:00",
            "date_modified": "2024-08-06T15:43:11+02:00"
        },
        {
            "id": "https://troi.se/chief-architect-and-head-of-architecture.html",
            "url": "https://troi.se/chief-architect-and-head-of-architecture.html",
            "title": "Chief Architect and Head of Architecture",
            "summary": "As Chief Architect, I had the pleasure of building and working with a very focused and driven architecture team with the size of&hellip;",
            "content_html": "\n  <p>\n    As Chief Architect, I had the pleasure of building and working with a very focused and driven architecture team with the size of \"Two Large Pizzas\" who did a amazing job together with our key bussiness stakeholders, in-house partners and development teams.<br><br>I was also a member of the IT management team and reported to CIO.<br><br>Here are some examples of the work we did while acting as change agents for the organizations digital transformation.<br><br>## Digital transformation<br>We worked hard to clarify the IT operational model and aligne it for the need of <br>more efficient deliveries of customer value and establish IT as a value-creating <br>partner in the business and not just as a supplier.<br><br>This resulted in the beginning of productization of the organization's capabilities <br>together with modern agile principles, working methods and technology where IT is <br>seen as a natural part of the company's business development.<br><br><br>## IT-strategy<br><br>As part of the digitization, we also was responsible for developing an IT strategy that <br>clearly described and guided the organization towards the targeted state.<br><br>The IT strategy we produced was based on an IT strategic framework that highlights six strategic areas <br>with the aim of strengthening customer focus, collaboration and innovation. <br><br>The Strategic areas where:<br><br>- Ensuring continuous competence development<br>- Designing solutions for effective and continuous improvement<br>- Embracing the innovative power of the outside world<br>- Ensuring trusting relationships<br>- Activating the digital eco system<br>- Exploring the power of intelligent technology.<br><br>This resulted in an architecture evolution and modernization of the self developed claims systems, skills transfer and new infrastructure with a focus on customer value, automation, loosely coupled services, DevOps and everything as code.<br><br><br>## Enterprise architecture<br><br>Another mission was to define and establish the capabilities around enterprise architecture:<br><br>- Business architecture<br>- Information architecture<br>- Solution architecture<br>- Infrastructure architecture<br>- Security architecture.<br><br>This resulted in an enterprise architecture function with light-weight <br>documentation of architectural decisions, guiding principles and a curious coaching <br>approach, which together with various business areas and delivery teams develops the <br>organization's offering in \"business services\" based on the business capabillities.<br><br>## Collaboration and communication<br><br>As a natural part of all transformations, it required collaboration <br>and clear communication and anchoring with both management and employees <br>regarding changed responsibilities, competencies, delivery models. <br><br>It also changed and developed the business processes and business offers both within the <br>organization and externally.<br><br>One of the biggest changes was the creation of \"Business Products\", cross functional teams that included both business and developement competences to be able to act quick within a specified domain based on the business capabillity map with a clear RACI model. The teams where staffed by self selection with no management interferance. The process in short, the product owner first pitch their product and then every individual by them self selected the product they wanted to work with. We did this in close cooperation with product management and was a big step in the digialization journey. <br><br>The archiecture team had daily close contact with the teams and in most cases also a team member to drive the solution against the target architecture using the guiding principles.<br><br>## Audits<br><br>The architecture team also supported internal and external auditors to guide them in solutions and documentation.<br><br><br>## Data protection and GDPR<br><br>The architecture team also supported the data protection function and business domains around process development, implementation and implementation of processes linked to data protection.<br><br>And ofcourse we did al lot more :)\n  </p>",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
                   "Assignment"
            ],
            "date_published": "2024-08-06T15:07:03+02:00",
            "date_modified": "2024-08-06T15:44:18+02:00"
        },
        {
            "id": "https://troi.se/it-architect-team-commercial.html",
            "url": "https://troi.se/it-architect-team-commercial.html",
            "title": "IT Architect, Team Commercial",
            "summary": "Member of the commercial team at Telia CPS Product and Transformation, PA Pay TV. Team commercial handles and continously evolve solutions around purchase&hellip;",
            "content_html": "\n  <p>\n    Member of the commercial team  at Telia CPS Product and Transformation, PA Pay TV.<br><br>Team commercial handles and continously evolve solutions around purchase flows, In-app-messages, products, subscription management, PSP, payments, marketing and CRM for C More and Telia play.\n  </p>",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
                   "Assignment"
            ],
            "date_published": "2024-08-06T14:49:27+02:00",
            "date_modified": "2024-08-06T15:45:04+02:00"
        },
        {
            "id": "https://troi.se/integration-strategy-and-enterprise-architecture.html",
            "url": "https://troi.se/integration-strategy-and-enterprise-architecture.html",
            "title": "Integration strategy and Enterprise architecture",
            "summary": "Architect in the initiative concerning integration modernization and system documentation for Business Apps Sweden (B2B advertising). - Establish Integration strategy - Domain dokumentation&hellip;",
            "content_html": "\n  <p>\n    Architect in the initiative concerning integration modernization and system documentation for Business Apps Sweden (B2B advertising).<br><br>- Establish Integration strategy<br>- Domain dokumentation<br>- Member of the Integration team\n  </p>\n\n  <p>\n    In addition to the above, I also served as the technical and solution lead for TV4 and MTV's new self-service ad purchasing solution - TV4 Media Manager.\n  </p>",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
                   "Assignment"
            ],
            "date_published": "2024-08-06T14:47:16+02:00",
            "date_modified": "2024-08-07T08:59:51+02:00"
        },
        {
            "id": "https://troi.se/payment-as-a-service.html",
            "url": "https://troi.se/payment-as-a-service.html",
            "title": "Payment as a service",
            "summary": "My first assignment as a solution architect consultant was to change payment solution and checkout flows for a transaction-intensive product. The solution covered&hellip;",
            "content_html": "\n  <p>\n    My first assignment as a solution architect consultant was to change payment solution and checkout flows for a transaction-intensive product. <br>The solution covered integrations with CRM and internal business processes. <br><br>The assignment included collaboration with external partners, target- and solution architecture as well as implementation and migration.&nbsp;\n  </p>\n\n  <p>\n    \n  </p>",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
                   "Assignment"
            ],
            "date_published": "2024-08-06T14:46:28+02:00",
            "date_modified": "2024-08-06T15:45:35+02:00"
        },
        {
            "id": "https://troi.se/contact-information.html",
            "url": "https://troi.se/contact-information.html",
            "title": "Contact information",
            "summary": "TROi Arkitektur AB Gnejsvägen 13B 132 35 Saltsjö-boo Sweden Mobile: 0708-93 95 51 Email : Christoffer.Rasten@TROi.se Org.number 559322-1889",
            "content_html": "\n  <p class=\"align-center\">\n    <strong>TROi Arkitektur AB</strong><br><br>Gnejsvägen 13B<br>132 35 Saltsjö-boo<br>Sweden <br><br><br>Mobile: 0708-93 95 51<br>Email : Christoffer.Rasten@TROi.se <br><br>Org.number 559322-1889\n  </p>\n\n  <p>\n    \n  </p>",
            "image": "https://troi.se/media/posts/20/Skarmavbild-2024-08-05-kl.-15.43.37.png",
            "author": {
                "name": "Christoffer Råsten"
            },
            "tags": [
            ],
            "date_published": "2024-08-06T13:41:50+02:00",
            "date_modified": "2024-08-06T13:44:39+02:00"
        }
    ]
}
